examonline/app/views/tests/edittest.html.erb

    <%= form_for @test, :url => {:controller => 'tests', :action => 'savetest'} do |t| %>
      <div class="select_space">Subject:          <%= t.collection_select :subject, Subject.all, :subject, :subject %></div>
---
SELECT "subjects".* FROM "subjects"