examonline/app/views/tests/test_paper.html.erb

<% @sub = Test.find(session[:test_id]).subject.capitalize %>
---
SELECT  "tests".* FROM "tests"  WHERE "tests"."id" = ? LIMIT 1  [["id", 3]]

          <% if question.multichoice.to_s == "Yes" %>
            <% question.question_options.sample(5).each do |option| %>
---
SELECT "question_options".* FROM "question_options"  WHERE "question_options"."question_id" = ?  [["question_id", 22]]