examonline/app/views/misc/_instructions.html.erb

  <li>Each question carry 1 mark, no negative marks.</li>
  <li>Time alloted : <%= Test.find(session[:test_id]).duration %> minutes.</li>
---
SELECT  "tests".* FROM "tests"  WHERE "tests"."id" = ? LIMIT 1  [["id", 3]]