examonline/app/controllers/admin_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
  def home
    if !session[:user_id]
      flash[:notice] = "You Need to Log In First"
      redirect_to(:action => 'login', :controller=>'users')
    elsif !(User.find(session[:user_id]).usertype == 'Admin')

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "users".* FROM "users"  WHERE (email LIKE ('%%')) AND (name LIKE ('%Aayushi%')) AND (experience >0) AND (phone LIKE ('%%')) AND (usertype LIKE ('%')) LIMIT 10 OFFSET 0
---
  def view
    if !session[:user_id]
      flash[:notice] = "You Need to Log In First"
      redirect_to(:action => 'login', :controller=>'users')
    elsif !(User.find(session[:user_id]).usertype == 'Admin')
      reset_session
      flash[:notice] = "You were successfully logged out"
      redirect_to(:controller => 'users', :action => 'login')
    else
      if params[:commit] == "Apply"
        @filteredusers = userfilter(params[:name], params[:email], params[:exp], params[:expval], params[:phone], params[:usertype])
        @users = @filteredusers.paginate(:page => params[:page], :per_page => 10)
      else
        @users = User.all.paginate(:page => params[:page], :per_page => 10)

SELECT  "users".* FROM "users"  WHERE "users"."id" = 5  ORDER BY "users"."id" ASC LIMIT 1
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 5]]
---
  def destroyuser
    if session[:user_id].to_s == params[:id].to_s
      flash[:notice] = "Can't delete Logged In User"
      redirect_to :action => 'view', :controller => 'admin'
    else
      @user = User.where(id: params[:id]).first
      if @user
        @user.destroy

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT "subjects".* FROM "subjects"
---
  def newques
    if !session[:user_id]
      flash[:notice] = "You Need to Log In First"
      redirect_to(:action => 'login', :controller=>'users')
    elsif !(User.find(session[:user_id]).usertype == 'Admin')
      reset_session
      flash[:notice] = "You were successfully logged out"
      redirect_to(:controller => 'users', :action => 'login')
    else
      @question = Question.new
      @options = QuestionOption.new
      @subject = Subject.all

INSERT INTO "questions" ("created_at", "isactive", "multichoice", "ques", "quetype", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-09-15 10:03:08.150207"], ["isactive", "Active"], ["multichoice", "No"], ["ques", "ghssssssssss"], ["quetype", "general"], ["updated_at", "2014-09-15 10:03:08.150207"]]
INSERT INTO "question_options" ("created_at", "option", "question_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-09-15 10:03:08.264684"], ["option", "f"], ["question_id", 96], ["updated_at", "2014-09-15 10:03:08.264684"]]
SELECT  1 AS one FROM "questions"  WHERE ("questions"."ques" = 'ghssssssssss' AND "questions"."id" != 96) LIMIT 1
SELECT "question_options".* FROM "question_options"  WHERE "question_options"."question_id" = ?  [["question_id", 97]]
UPDATE "questions" SET "answers" = ?, "updated_at" = ? WHERE "questions"."id" = 96  [["answers", "397,398,399,400"], ["updated_at", "2014-09-15 10:03:08.672683"]]
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = ? LIMIT 1  [["id", 96]]
DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 97]]
---
  def addques
    answers = params[:answers].split(",")
    answers = answers.collect{|x| x = x.strip}
    ans = Array.new
    x = 0
    chk = false
    @question = Question.new(:ques => params[:ques], :quetype => params[:quetype][:sub], :multichoice => params[:multichoice], :isactive => params[:isactive])
    if @question.save
      params[:options].each do |key, opt|
        @option = @question.question_options.create(:option => opt)
        if @option.save && !opt.blank?
          chk = true
        else
          flash[:notice] = "Blank option not allowed"
          chk = false
          break
        end
        if answers.include?(opt)
          ans[x]=@option.id
          x=x+1
        end
      end
      c = ans.join(",")
      answer = Question.find(@question.id)
      answer.update(answers: c)
      if ans.empty? || (params[:answers].include?(",") && params[:multichoice] == "No")
        chk = false
        flash[:notice] = "Empty or invalid answers"
        delques = Question.find(@question.id)
        delques.destroy

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "questions".* FROM "questions"  WHERE (quetype LIKE ('%general%')) AND (multichoice LIKE ('%')) AND (isactive LIKE ('%')) LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "questions"  WHERE (quetype LIKE ('%aptitude%')) AND (multichoice LIKE ('%')) AND (isactive LIKE ('%'))
---
  def viewquestions
    if !session[:user_id]
      flash[:notice] = "You Need to Log In First"
      redirect_to(:action => 'login', :controller=>'users')
    elsif !(User.find(session[:user_id]).usertype == 'Admin')
      reset_session
      flash[:notice] = "You were successfully logged out"
      redirect_to(:controller => 'users', :action => 'login')
    else
      if params[:commit] == "Apply"
        @filteredquestions = questionfilter(params[:quetype][:sub], params[:multichoice], params[:isactive])
        @questions = @filteredquestions.paginate(:page => params[:page], :per_page => 5)
      else
        @questions = Question.all.paginate(:page => params[:page], :per_page => 5)

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
  def newtest
    if !session[:user_id]
      flash[:notice] = "You Need to Log In First"
      redirect_to(:action => 'login', :controller=>'users')
    elsif !(User.find(session[:user_id]).usertype == 'Admin')

SELECT  "users".* FROM "users"  WHERE "users"."id" = 2  ORDER BY "users"."id" ASC LIMIT 1
SELECT  "tests".* FROM "tests"  LIMIT 5 OFFSET 0
---
  def viewtest
    if !session[:user_id]
      flash[:notice] = "You Need to Log In First"
      redirect_to(:action => 'login', :controller=>'users')
    elsif !(User.find(session[:user_id]).usertype == 'Admin')
      reset_session
      flash[:notice] = "You were successfully logged out"
      redirect_to(:controller => 'users', :action => 'login')
    else
      if params[:commit] == "Apply"
        @filteredtests = testfilter(params[:quetype][:sub], params[:time], params[:timeval], params[:qnum], params[:qnumval], params[:isactive], params[:createdby])
        @tests = @filteredtests.paginate(:page => params[:page], :per_page => 5)
      else
        @tests = Test.all.paginate(:page => params[:page], :per_page => 5)

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT "subjects".* FROM "subjects"
SELECT  "results".* FROM "results"  LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "results"
SELECT  DISTINCT "results"."user_id" FROM "results"  LIMIT 10 OFFSET 0
---
  def stats
    if !session[:user_id]
      flash[:notice] = "You Need to Log In First"
      redirect_to(:action => 'login', :controller=>'users')
    elsif !(User.find(session[:user_id]).usertype == 'Admin')
      reset_session
      flash[:notice] = "You were successfully logged out"
      redirect_to(:controller => 'users', :action => 'login')
    else
      if params[:commit] == "Apply"
        event = params[:dateval]
        dateval = Date.new event["on(1i)"].to_i, event["on(2i)"].to_i, event["on(3i)"].to_i
        @filteredstats = statfilter(params[:testid], params[:subject][:sub], params[:user],params[:qnum], params[:qnumval], params[:percent], params[:percentval], params[:date], dateval)
        @stats = @filteredstats.paginate(:page => params[:page], :per_page => 10)
      else
        @stats = Result.all.paginate(:page => params[:page], :per_page => 10)
      end
      @correct = 0
      @incorrect = 0
      @statcount = @stats.count
      @usercount = @stats.uniq.pluck(:user_id).count
      @stats.each do |res|

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT "questions".* FROM "questions"
---
  def csv_actions
    if !session[:user_id]
      flash[:notice] = "You Need to Log In First"
      redirect_to :action => 'login', :controller=>'users'
    elsif !(User.find(session[:user_id]).usertype == 'Admin')
      reset_session
      flash[:notice] = "You were successfully logged out"
      redirect_to(:controller => 'users', :action => 'login')
    else
      @questions = Question.all

SELECT  1 AS one FROM "questions"  WHERE ("questions"."ques" = 'A train 125 m long passes a man running at 5 km/hr in the same direction in which the train is going in 10 seconds. The speed of the train is:' AND "questions"."id" != 12) LIMIT 1
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = 12 LIMIT 1
UPDATE "questions" SET "ques" = ?, "updated_at" = ? WHERE "questions"."id" = 45  [["ques", "How many of the following numbers are divisible by 132 ?\n264, 396, 462, 792, 968, 2178, 5184, 6336"], ["updated_at", "2014-09-23 05:11:58.248634"]]
SELECT "question_options".* FROM "question_options"  WHERE "question_options"."question_id" = ? AND "question_options"."question_id" IS NULL  [["question_id", 12]]
SELECT  "question_options".* FROM "question_options"  WHERE "question_options"."id" = ? LIMIT 1  [["id", 48]]
---
  def import_questions
    if params[:file]
      @invalid_ids = Array.new
      CSV.foreach(params[:file].path, headers: true) do |line|
        @id = line.to_hash["id"]
        if !@id.blank?
          if !line.to_hash["answers"].blank? && !line.to_hash["options"].blank? && !line.to_hash["question"].blank? && !line.to_hash["subject"].blank? && !line.to_hash["multichoice"].blank? && !line.to_hash["isactive"].blank?
            if !Question.find_by_id(@id).blank?
              #------------------- Update Question
              answers = line.to_hash["answers"].split(",")
              answers = answers.collect{|x| x = x.strip}
              ans = Array.new
              @opts = line.to_hash["options"].split(",").collect{|x| x = x.strip}
              i = 0
              chk = false
              @question = Question.find(@id)
              if @question.update(:ques => line.to_hash["question"], :quetype => line.to_hash["subject"], :multichoice => line.to_hash["multichoice"], :isactive => line.to_hash["isactive"])
                @options = @question.question_options.where(question_id: @id)
                var_opt = Array.new
                @opts.each do |val|
                  var_opt.push(val)
                end
                len = var_opt.length
                var = 0
                @options.each do |opt|

INSERT INTO "questions" ("created_at", "isactive", "multichoice", "ques", "quetype", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "question_options" ("created_at", "question_id", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-09-23 05:11:59.791809"], ["question_id", 89], ["updated_at", "2014-09-23 05:11:59.791809"]]
---
              x = 0
              chk = false
              @question = Question.new(:id => @id, :ques => line.to_hash["question"], :quetype => line.to_hash["subject"], :multichoice => line.to_hash["multichoice"], :isactive => line.to_hash["isactive"])
              if @question.save
                @opts.each do |opt|
                  @option = @question.question_options.create(:option => opt)

DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 89]]
---
                if ans.empty? || (line.to_hash["answers"].include?(",") && line.to_hash["multichoice"] == "No")
                  chk = false
                  delques = Question.find(@id)
                  delques.destroy