examonline/app/controllers/tests_controller.rb

SELECT  "tests".* FROM "tests"  WHERE "tests"."id" = ? LIMIT 1  [["id", 3]]
---
  def settimer
    if !(session[:test_id] || session[:user_id])
      flash[:notice] = "You Need to Log In First"
      redirect_to(:action => 'home', :controller=>'tests')
    elsif !(session[:test_hour].blank? || session[:test_min].blank?)
      session.delete "test_hour"
      session.delete "test_min"
      session.delete "test_id"
      redirect_to(:action => 'home', :controller=>'users')
    else
      session[:questions] = []
      t = Time.now
      x = Test.find(session[:test_id]).duration

SELECT  "tests".* FROM "tests"  WHERE "tests"."id" = ? LIMIT 1  [["id", 3]]
SELECT "questions".* FROM "questions"  WHERE "questions"."quetype" = 'aptitude' AND "questions"."isactive" = 'Active'
SELECT "questions".* FROM "questions"  WHERE "questions"."id" IN (65, 77, 48, 53, 41, 44, 46, 26, 22, 79)
---
  def test_paper
    if !(session[:test_id] || session[:user_id])
      flash[:notice] = "You Need to Log In First"
      redirect_to(:action => 'home', :controller=>'tests')
    else
      if session[:questions].blank?
        @count = Test.find(session[:test_id]).quescount
        @subject = Test.find(session[:test_id]).subject
        @ques = Question.where(quetype: @subject, isactive: 'Active').sample(@count)
        @ques.each{|z| session[:questions] << z.id}
      end
      @arr = Array.new
      session[:questions].each do |q|
        @arr << q
      end
      @questions = Question.find( @arr )

SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = 22 LIMIT 1
SELECT  "tests".* FROM "tests"  WHERE "tests"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "results".* FROM "results"  WHERE "results"."user_id" = 5 AND "results"."test_time" = '10:53:07' LIMIT 1
---
  def result
    @correct = 0
    if params[:mcq]
      params[:mcq].each do |mcqk, mcqa|
        a = Array.new
        b = Array.new
        params[:mcq][mcqk].each{|x| b.push(x)}
        Question.find_by(id: mcqk).answers.split(",").each{|x| a.push(x)}
        if (b - a).empty? && (a - b).empty?
          @correct += 1
        end
      end
    end
    if params[:scq]
      params[:scq].each do |scqk, scqa|
        if Question.find_by(id: scqk).answers.to_s == scqa.to_s
          @correct += 1
        end
      end
    end
    @count = Test.find(session[:test_id]).quescount.to_i
    @incorrect = @count - @correct
    @test_time = "#{session[:test_hour]}:#{session[:test_min]}:#{session[:test_sec]}"
    if !Result.find_by(user_id: session[:user_id], test_time: @test_time)

SELECT  "tests".* FROM "tests"  WHERE "tests"."testlogin" = 'a_1' AND "tests"."testpass" = 'password' LIMIT 1
---
  def test_login
    authorized_test = Test.find_by(testlogin: params[:testlogin],testpass: params[:testpass])

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "tests".* FROM "tests"  WHERE "tests"."id" = ? LIMIT 1  [["id", 3]]
---
  def edittest
    if !session[:user_id]
      flash[:notice] = "You Need to Log In First"
      redirect_to(:controller => 'users', :action => 'login')
    elsif !(User.find(session[:user_id]).usertype == 'Admin')
      reset_session
      flash[:notice] = "You have been logged out Successfully"
      redirect_to(:controller => 'users', :action => 'login')
    else
      session[:temp_id]=params[:test_id]
      @test = Test.find(session[:temp_id])

SELECT  "tests".* FROM "tests"  WHERE "tests"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "tests" SET "quescount" = ?, "updated_at" = ? WHERE "tests"."id" = 3  [["quescount", 10], ["updated_at", "2014-09-22 04:47:43.918470"]]
---
  def savetest
    @test = Test.find(session[:temp_id])
    if params[:test][:testpass].blank?
      if @test.update(test_params)