examonline/app/controllers/tests_controller.rb

SELECT  "tests".* FROM "tests"  WHERE "tests"."id" = ? LIMIT 1  [["id", 3]]
---
  def instructions
    if !(session[:test_id] || session[:user_id])
      flash[:notice] = "You Need to Log In First"
      redirect_to(:action => 'home', :controller=>'tests')
    end
    t = Time.now
    x = Test.find(session[:test_id]).duration