examonline/app/controllers/users_controller.rb

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 5]]
---
  def destroy_multiple
    if params[:users]
      User.destroy(params[:users])

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 6]]
---
  def tryedit
    @user = User.find(session[:temp_id])

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
  def adduser
    if !session[:user_id]
      flash[:notice] = "You Need to Log In First"
      redirect_to(:action => 'login', :controller=>'users')
    elsif !(User.find(session[:user_id]).usertype == 'Admin')

INSERT INTO "users" ("activity", "created_at", "email", "encrypted_password", "experience", "name", "phone", "salt", "updated_at", "usertype") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def addnew
    @user = User.new(user_params2)
    @pass = rand_string
    @user.password = @pass
    @name = @user.name
    @email = @user.email
    if params[:commit] == 'Create'
      if @user.save

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
  def edituser
    if !session[:user_id]
      flash[:notice] = "You Need to Log In First"
      redirect_to(:action => 'login', :controller=>'users')
    elsif !(User.find(session[:user_id]).usertype == 'Admin')

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
  def profile
    case chk_session
    when 'Examinee'
      @cuser = User.where("id = '#{session[:user_id]}'")

SELECT  "results".* FROM "results"  WHERE "results"."user_id" = 5 LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "results"  WHERE "results"."user_id" = 5
---
  def home
    case chk_session
    when 'Admin'
      redirect_to(:controller => 'admin', :action => 'home')
    when 'Examiner'
      flash[:notice] = "Your page is under construction"
      redirect_to(:controller => 'users', :action => 'home')
    when 'Examinee'
      @correct = 0
      @incorrect = 0
      @results = Result.where(user_id: session[:user_id]).paginate(:page => params[:page], :per_page => 5)

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "users" SET "encrypted_password" = ?, "salt" = ?, "updated_at" = ? WHERE "users"."id" = 4  [["encrypted_password", "b2e9c14a905f13f7f6ceb4e747e497825541f0b0"], ["salt", "ca4a604b0b4682689732188a3edd9f9bae0f34ec"], ["updated_at", "2014-09-22 04:45:01.247109"]]
---
  def reset_pass
    if session[:temp_id]
      @user = User.find(session[:temp_id])
      @password = rand_string
      UserMailer.reset_pass_email(@user.name, @user.email, @password).deliver
      if @user.update(password: @password)