examonline/app/views/users/home.html.erb

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 5]]
---

<h1>Welcome <%= User.find(session[:user_id]).name %></h1>

SELECT  "tests".* FROM "tests"  WHERE "tests"."id" = ? LIMIT 1  [["id", 3]]
---
        <div class="tr">
          <div class="td"><%= Test.find(result.test_id).subject %></div>