examonline/app/views/admin/csv_actions.csv.erb

  @optionarr = Array.new
  question.question_options.each do |option|
---
SELECT "question_options".* FROM "question_options"  WHERE "question_options"."question_id" = ?  [["question_id", 74]]

  @ans.each do |ans|
    @answerarr << QuestionOption.find(ans).option
---
SELECT  "question_options".* FROM "question_options"  WHERE "question_options"."id" = ? LIMIT 1  [["id", 308]]