examonline/app/views/admin/newques.html.erb

      Question:<br> <%= text_area_tag 'ques' %><br>
      <div class="select_space">Subject:          <%= collection_select 'quetype', :sub, Subject.all, :subject, :subject %></div>
---
SELECT "subjects".* FROM "subjects"