examonline/app/views/admin/newtest.html.erb

    <%= form_for @test, :url => {:controller => 'admin', :action => 'addtest'} do |t| %>
      <div class="select_space">Subject:          <%= t.collection_select :subject, Subject.all, :subject, :subject %></div>
---
SELECT "subjects".* FROM "subjects"