examonline/app/views/admin/settings.html.erb

SELECT "subjects".* FROM "subjects"
---
      Select Subject:
      <%= collection_select 'subject', :sub, Subject.all, :subject, :subject %>