examonline/app/views/admin/stats.html.erb

SELECT "subjects".* FROM "subjects"
---
      Test ID:<%= text_field_tag 'testid', params[:testid] %>
      Subject:<%= collection_select 'subject', :sub, Subject.all, :subject, :subject, :prompt => true %>

SELECT  "tests".* FROM "tests"  WHERE "tests"."id" = 3 LIMIT 1
---
        <div class="tr">
          <div class="td"><%= Test.find(result.test_id).testname %></div>

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
          <div class="td"><%= Test.find(result.test_id).subject %></div>
          <div class="td"><%= User.find(result.user_id).name %></div>