examonline/app/views/admin/viewtest.html.erb

  <%= form_tag url_for(:controller => 'admin', :action => 'viewtest'), method: "get" do %>
    Subject: <%= collection_select 'quetype', :sub, Subject.all, :subject, :subject, :prompt => true %>
---
SELECT "subjects".* FROM "subjects"

            <div class="td"><%= test.testpass %></div>
            <div class="td"><% @user=User.where(id: test.createdby).first %>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 2  ORDER BY "users"."id" ASC LIMIT 1