examonline/app/views/admin/viewquestions.html.erb

  <%= form_tag url_for(:controller => 'admin', :action => 'viewquestions'), method: "get" do %>
    Subject: <%= collection_select 'quetype', :sub, Subject.all, :subject, :subject, {:prompt => true} %>
---
SELECT "subjects".* FROM "subjects"

            <div class="td"><%= question.isactive %></div>
            <div class="td"><% question.question_options.each do |option| %>
---
SELECT "question_options".* FROM "question_options"  WHERE "question_options"."question_id" = ?  [["question_id", 11]]